{
    "Connection": {
        "alternate full address": {"type":"s","value":"","description":"Specifies an alternate name or IP address of the remote computer that you want to connect to."},
        "authentication level": {"type":"i","value":"2","description":"Determines what should happen when server authentication fails.\n\n0 - If server authentication fails, connect without giving a warning.\n1 - If server authentication fails, do not connect.\n2 - If server authentication fails, show a warning and allow the user to connect or not.\n3 - Server authentication is not required."},
        "autoreconnect max retries": {"type":"i","value":"20","description":"Determines the maximum number of times the client computer will try to reconnect to the remote computer if the connection is dropped.\nNote: The maximum value Remote Desktop can handle is 200."},
        "autoreconnection enabled": {"type":"i","value":"1","description":"Determines whether the client computer will automatically try to reconnect to the remote computer if the connection is dropped.\n\n0 - Do not attempt to reconnect.\n1 - Attempt to reconnect."},
        "bandwidthautodetect": {"type":"i","value":"1","description":"Enables the option for automatic detection of the network type. Used in conjunction with networkautodetect. Also see connection type.\n\n0 - Do not enable the option for automatic network detection.\n1 - Enable the option for automatic network detection."},
        "compression": {"type":"i","value":"1","description":"Determines whether the connection should use bulk compression.\n\n0 - Do not use bulk compression.\n1 - Use bulk compression."},
        "connection type": {"type":"i","value":"2","description":"Specifies pre-defined performance settings for the Remote Desktop session.\n\n1 - Modem (56 Kbps).\n2 - Low-speed broadband (256 Kbps - 2 Mbps).\n3 - Satellite (2 Mbps - 16 Mbps with high latency).\n4 - High-speed broadband (2 Mbps - 10 Mbps).\n5 - WAN (10 Mbps or higher with high latency).\n6 - LAN (10 Mbps or higher).\n7 - Automatic bandwidth detection. Requires bandwidthautodetect.\n\nBy itself, this setting does nothing. When selected in the RDC GUI, this option changes several performance related settings (themes, animation, font smoothing, etcetera). These separate settings always overrule the connection type setting."},
        "domain": {"type":"s","value":"","description":"Specifies the name of the domain of the user."},
        "enablecredsspsupport": {"type":"i","value":"1","description":"Determines whether Remote Desktop will use CredSSP for authentication if it's available.\n\n0 - Do not use CredSSP, even if the operating system supports it.\n1 - Use CredSSP, if the operating system supports it."},
        "enablerdsaadauth": {"type":, "i", "value": "0", "description": "Determines whether the client will use Microsoft Entra ID to authenticate to the remote PC. When used with Azure Virtual Desktop, this provides a single sign-on experience. This property replaces the property targetisaadjoined.\n\n0 - Connections won't use Microsoft Entra authentication, even if the remote PC supports it.\n1 - Connections will use Microsoft Entra authentication if the remote PC supports it."},
        "full address": {"type":"s","value":"","description":"Specifies the name or IP address (and optional port) of the remote computer that you want to connect to."},
        "kdcproxyname": {"type":, "s", "value": "", "description": "Specifies the fully qualified domain name of a KDC proxy."},
        "negotiate security layer": {"type":"i","value":"1","description":"Determines whether the level of security is negotiated or not.\n\n0 - Security layer negotiation is not enabled and the session is started by using Secure Sockets Layer (SSL).\n1 - Security layer negotiation is enabled and the session is started by using x.224 encryption."},
        "networkautodetect": {"type":"i","value":"1","description":"Determines whether to use automatic network bandwidth detection or not. Requires the option bandwidthautodetect to be set and correlates with connection type 7.\n\n0 - Use automatic network bandwitdh detection.\n1 - Do not use automatic network bandwitdh detection."},
        "password 51": {"type":"b","value":"","description":"The user password in a binary hash value."},
        "prompt for credentials": {"type":"i","value":"0","description":"Determines whether Remote Desktop Connection will prompt for credentials when connecting to a remote computer for which the credentials have been previously saved.\n\n0 - Remote Desktop will use the saved credentials and will not prompt for credentials.\n1 - Remote Desktop will prompt for credentials."},
        "prompt for credentials on client": {"type":"i","value":"0","description":"Determines whether Remote Desktop Connection will prompt for credentials when connecting to a server that does not support server authentication.\n\n0 - Remote Desktop will not prompt for credentials.\n1 - Remote Desktop will prompt for credentials."},
        "promptcredentialonce": {"type":"i","value":"1","description":"When connecting through an RD Gateway, determines whether RDC should use the same credentials for both the RD Gateway and the remote computer.\n\n0 - Remote Desktop will not use the same credentials .\n1 - Remote Desktop will use the same credentials for both the RD gateway and the remote computer."},
        "server port": {"type":"i","value":"3389","description":"Defines an alternate default port for the Remote Desktop connection.\n\nWill be overruled by any port number appended to the server name."},
        "targetisaadjoined": {"type":, "i", "value": "0", "description": "Allows connections to Microsoft Entra joined session hosts using a username and password. This property is only applicable to non-Windows clients and local Windows devices that aren't joined to Microsoft Entra.\n\n0 - Connections to Microsoft Entra joined session hosts will succeed for Windows devices that meet the requirements, but other connections will fail.\n1 - Connections to Microsoft Entra joined hosts will succeed but are restricted to entering user name and password credentials when connecting to session hosts.\n\nNote: This property is being replaced by enablerdsaadauth."},
        "username": {"type":"s","value":"","description":"Specifies the name of the user account that will be used to log on to the remote computer."}
    },

    "Display": {
        "allow desktop composition": {"type":"i","value":"0","description":"Determines whether desktop composition (needed for Aero) is permitted when you log on to the remote computer.\n\n0 - Disable desktop composition in the remote session.\n1 - Desktop composition is permitted."},
        "allow font smoothing": {"type":"i","value":"0","description":"Determines whether font smoothing may be used in the remote session.\n\n0 - Disable font smoothing in the remote session.\n1 - Font smoothing is permitted."},
        "bitmapcachepersistenable": {"type":"i","value":"1","description":"Determines whether bitmaps are cached on the local computer (disk-based cache). Bitmap caching can improve the performance of your remote session.\n\n0 - Do not cache bitmaps.\n1 - Cache bitmaps."},
        "bitmapcachesize": {"type":"i","value":"1500","description":"Specifies the size in kilobytes of the memory-based bitmap cache. The maximum value is 32000."},
        "desktopheight": {"type":"i","value":"600","description":"The height (in pixels) of the remote session desktop."},
        "desktop size id": {"type":"i","value":"0","description":"Specifies pre-defined dimensions of the remote session desktop.\n\n0 - 640x480.\n1 - 800x600.\n2 - 1024x768.\n3 - 1280x1024.\n4 - 1600x1200.\n\nThis setting is ignored when either /w and /h, or desktopwidth and desktopheight are already specified."},
        "desktopscalefactor": {"type":, "i", "value": "", "description": "Specifies the scale factor of the remote session to make the content appear larger.\n\nSupported values:\nNumerical value from the following list: 100, 125, 150, 175, 200, 250, 300, 400, 500\n\nNote: The desktopscalefactor property is being deprecated and will soon be unavailable."},
        "desktopwidth": {"type":"i","value":"800","description":"The width (in pixels) of the remote session desktop."},
        "disable full window drag": {"type":"i","value":"1","description":"Determines whether window content is displayed when you drag the window to a new location.\n\n0 - Show the contents of the window while dragging.\n1 - Show an outline of the window while dragging."},
        "disable menu anims": {"type":"i","value":"1","description":"Determines whether menus and windows can be displayed with animation effects in the remote session.\n\n0 - Menu and window animation is permitted.\n1 - No menu and window animation."},
        "disable themes": {"type":"i","value":"0","description":"Determines whether themes are permitted when you log on to the remote computer.\n\n0 - Themes are permitted.\n1 - Disable theme in the remote session."},
        "disable wallpaper": {"type":"i","value":"1","description":"Determines whether the desktop background is displayed in the remote session.\n\n0 - Display the wallpaper.\n1 - Do not show any wallpaper."},
        "dynamic resolution": {"type":, "i", "value": "1", "description": "Determines whether the resolution of a remote session is automatically updated when the local window is resized.\n\n0 - Session resolution remains static during the session.\n1 - Session resolution updates as the local window resizes."},
        "enablesuperpan": {"type":"i","value":"0","description":"Determines whether SuperPan is enabled or disabled. SuperPan allows the user to navigate a remote desktop in full-screen mode without scroll bars, when the dimensions of the remote desktop are larger than the dimensions of the current client window. The user can point to the window border, and the desktop view will scroll automatically in that direction.\n\n0 - Do not use SuperPan. The remote session window is sized to the client window size.\n1 - Enable SuperPan. The remote session window is sized to the dimensions specified through /w and /h, or through desktopwidth and desktopheight."},
        "encode redirected video capture": {"type":"i","value":"1","description":"Enables or disables encoding of redirected video.\n\n0 - Disable encoding of redirected video.\n\n1 - Enable encoding of redirected video."},
        "maximizetocurrentdisplays": {"type":, "i", "value": "0", "description": "Determines which display a remote session uses for full screen on when maximizing. Requires use multimon set to 1. Only available on Windows App for Windows and the Remote Desktop app for Windows.\n\n0 - Session is full screen on the displays initially selected when maximizing.\n1 - Session dynamically is full screen on the displays the session window spans when maximizing."},
        "redirectdirectx": {"type":"i","value":"1","description":"Determines whether DirectX will be enabled for the remote session.\n\n0 - Do not enable DirectX rendering.\n1 - Enable DirectX rendering in the remote session."},
        "screen mode id": {"type":"i","value":"2","description":"Determines whether the remote session window appears full screen when you connect to the remote computer.\n\n1 - The remote session will appear in a window.\n2 - The remote session will appear full screen."},
        "selectedmonitors": {"type":"s","value":"","description":"Specifies which local displays to use for the remote session. The selected displays must be contiguous. Requires use multimon to be set to 1.\n\nComma separated list of machine-specific display IDs. You can retrieve IDs by calling mstsc.exe /l. The first ID listed will be set as the primary display in the session. Defaults to all displays."},
        "session bpp": {"type":"i","value":"32","description":"Determines the color depth (in bits) on the remote computer when you connect.\n\n8 - 256 colors (8 bit).\n15 - High color (15 bit).\n16 - High color (16 bit).\n24 - True color (24 bit).\n32 - Highest quality (32 bit)."},
        "singlemoninwindowedmode": {"type":, "i", "value": "0", "description": "Determines whether a multi display remote session automatically switches to single display when exiting full screen. Requires use multimon set to 1. Only available on Windows App for Windows and the Remote Desktop app for Windows.\n\n0 - A remote session retains all displays when exiting full screen.\n1 - A remote session switches to a single display when exiting full screen."},
        "smart sizing": {"type":"i","value":"0","description":"Determines whether the client computer should scale the content on the remote computer to fit the window size of the client computer when the window is resized.\n\n0 - The client window display will not be scaled when resized.\n1 - The client window display will be scaled when resized."},
        "span monitors": {"type":"i","value":"0","description":"Determines whether the remote session window will be spanned across multiple monitors when you connect to the remote computer.\n\n0 - Monitor spanning is not enabled.\n1 - Monitor spanning is enabled.\n\nNote: When using Remote Desktop Connection 7 (Windows 7/2008), the use multimon setting is recommended."},
        "superpanaccelerationfactor": {"type":"i","value":"1","description":"Specifies the number of pixels that the screen view scrolls in a given direction for every pixel of mouse movement by the client when in SuperPan mode"},
        "use multimon": {"type":"i","value":"0","description":"Determines whether the session should use true multiple monitor support when connecting to the remote computer.\n\n0 - Do not enable multiple monitor support.\n1 - Enable multiple monitor support."},
        "videoplaybackmode": {"type":"i","value":"1","description":"Determines whether RDC will use RDP efficient multimedia streaming for video playback.\n\n0 - Do not use RDP efficient multimedia streaming for video playback.\n1 - Use RDP efficient multimedia streaming for video playback when possible."},
        "winposstr": {"type":"s","value":"0,3,0,0,800,600","description":"Specifies the position and dimensions of the session window on the client computer."}
    },

    "Gateway": {
        "gatewaycredentialssource": {"type":"i","value":"4","description":"Specifies the credentials that should be used to validate the connection with the RD Gateway.\n\n0 - Ask for password (NTLM).\n1 - Use smart card.\n4 - Allow user to select later."},
        "gatewayhostname": {"type":"s","value":"","description":"Specifies the hostname of the RD Gateway."},
        "gatewayprofileusagemethod": {"type":"i","value":"0","description":"Determines the RD Gateway authentication method to be used.\n\n0 - Use the default profile mode, as specified by the administrator.\n1 - Use explicit settings."},
        "gatewayusagemethod": {"type":"i","value":"4","description":"Specifies if and how to use a Remote Desktop Gateway (RD Gateway) server.\n\n0 - Do not use an RD Gateway server.\n1 - Always use an RD Gateway, even for local connections.\n2 - Use the RD Gateway if a direct connection cannot be made to the remote computer (i.e. bypass for local addresses).\n3 - Use the default RD Gateway settings.\n4 - Do not use an RD Gateway server.\n\n0 and 4 have the same effect, but setting the method to 4 also sets the option for bypassing local addresses in the Remote Desktop user interface."}
    },

    "Hardware": {
        "audiocapturemode": {"type":"i","value":"0","description":"Determines how sounds captured (recorded) on the local computer are handled when you are connected to the remote computer.\n\n0 - Do not capture audio from the local computer.\n1 - Capture audio from the local computer and send to the remote computer."},
        "audiomode": {"type":"i","value":"0","description":"Determines how sounds on a remote computer are handled when you are connected to the remote computer.\n\n0 - Play sounds on the local computer.\n1 - Play sounds on the remote computer.\n2 - Do not play sounds."},
        "audioqualitymode": {"type":"i","value":"0","description":"Determines the quality of the audio played in the remote session.\n\n0 - Dynamically adjust audio quality based on available bandwidth.\n1 - Always use medium audio quality.\n2 - Always use uncompressed audio quality."},
        "camerastoredirect": {"type":"s","value":"","description":"Configures which cameras to redirect. This setting uses a semicolon-delimited list of KSCATEGORY_VIDEO_CAMERA interfaces of cameras enabled for redirection."},
        "devicestoredirect": {"type":"s","value":"","description":"Determines which supported Plug and Play devices on the client computer will be redirected and available in the remote session.\n\nNo value specified - Do not redirect any supported Plug and Play devices.\n* - Redirect all supported Plug and Play devices, including ones that are connected later.\nDynamicDevices - Redirect any supported Plug and Play devices that are connected later.\nThe hardware ID for one or more Plug and Play devices - Redirect the specified supported Plug and Play device(s)."},
        "drivestoredirect": {"type":"s","value":"","description":"Determines which local disk drives on the client computer will be redirected and available in the remote session.\n\nNo value specified - Do not redirect any drives.\n* - Redirect all disk drives, including drives that are connected later.\nDynamicDrives - Redirect any drives that are connected later.\nThe drive and labels for one or more drives - Redirect the specified drive(s)."},
        "redirected video capture encoding quality": {"type":"i","value":"0","description":"Controls the quality of encoded video.\n\n0 - High compression video. Quality may suffer when there's a lot of motion.\n1 - Medium compression.\n2 - Low compression video with high picture quality."},
        "redirectcomports": {"type":"i","value":"0","description":"Determines whether the COM (serial) ports on the client computer will be redirected and available in the remote session.\n\n0 - The COM ports on the local computer are not available in the remote session.\n1 - The COM ports on the local computer are available in the remote session."},
        "redirectlocation": {"type":"i","value":"0","description":"Determines whether the location of the local device will be redirected and available in the remote session.\n\n0 - The remote session uses the location of the remote computer.\n1 - The remote session uses the location of the local device."},
        "redirectposdevices": {"type":"i","value":"0","description":"Determines whether Microsoft Point of Service (POS) for .NET devices connected to the client computer will be redirected and available in the remote session.\n\n0 - The POS devices from the local computer are not available in the remote session.\n1 - The POS devices from the local computer are available in the remote session."},
        "redirectprinters": {"type":"i","value":"1","description":"Determines whether printers configured on the client computer will be redirected and available in the remote session.\n\n0 - The printers on the local computer are not available in the remote session.\n1 - The printers on the local computer are available in the remote session."},
        "redirectsmartcards": {"type":"i","value":"1","description":"Determines whether smart card devices on the client computer will be redirected and available in the remote session.\n\n0 - The smart card device on the local computer is not available in the remote session.\n1 - The smart card device on the local computer is available in the remote session."},
        "usbdevicestoredirect": {"type":"s","value":"","description":"Determines which supported RemoteFX USB devices on the client computer will be redirected and available in the remote session when you connect to a remote session that supports RemoteFX USB redirection.\n\nNo value specified - Do not redirect any supported RemoteFX USB devices.\n* - Redirect all supported RemoteFX USB devices for redirection that are not redirected by high-level redirection mechanisms.\n{Device Setup Class GUID} - Redirect all supported RemoteFX USB devices that are members of the specified device setup class.\nUSB\\InstanceID - Redirect the supported RemoteFX USB device specified by the given instance ID.\n-USB\\InstanceID - Do not redirect the supported RemoteFX USB device specified by the given instance ID, even if the device is in a device setup class that is redirected.."}
    },

    "RemoteApp": {
        "disableremoteappcapscheck": {"type":"i","value":"0","description":"Specifies whether the Remote Desktop client should check the remote computer for RemoteApp capabilities.\n0 - Check the remote computer for RemoteApp capabilities before logging in.\n1 - Do not check the remote computer for RemoteApp capabilities.Note: This setting must be set to 1 when connecting to Windows XP SP3, Vista or 7 computers with RemoteApps configured on them."},
        "remoteapplicationcmdline": {"type":"s","value":"","description":"Optional command line parameters for the RemoteApp."},
        "remoteapplicationfile": {"type":"s","value":"","description":"Specifies a file to be opened on the remote computer by the RemoteApp.\n\nNote: For local files to be opened, you must also enable drive redirection for (at least) the source drive."},
        "remoteapplicationexpandcmdline": {"type":"i","value":"1","description":"Determines whether environment variables contained in the RemoteApp command line parameter should be expanded locally or remotely.\n\n0 - Environment variables should be expanded to the values of the local computer.\n1 - Environment variables should be expanded on the remote computer to the values of the remote computer."},
        "remoteapplicationexpandworkingdir": {"type":"i","value":"0","description":"Determines whether environment variables contained in the RemoteApp working directory parameter should be expanded locally or remotely.\n\n0 - Environment variables should be expanded to the values of the local computer.\n1 - Environment variables should be expanded on the remote computer to the values of the remote computer.\n\nNote: The RemoteApp working directory is specified through the shell working directory parameter."},
        "remoteapplicationicon": {"type":"s","value":"","description":"Specifies the file name of an icon file to be displayed in the Remote Desktop interface while starting the RemoteApp. By default RDC will show the standard Remote Desktop icon.\n\nNote: Only .ico files are supported."},
        "remoteapplicationmode": {"type":"i","value":"0","description":"Determines whether a RemoteApp shoud be launched when connecting to the remote computer.\n\n0 - Use a normal session and do not start a RemoteApp.\n1 - Connect and launch a RemoteApp."},
        "remoteapplicationname": {"type":"s","value":"","description":"Specifies the name of the RemoteApp in the Remote Desktop interface while starting the RemoteApp."},
        "remoteapplicationprogram": {"type":"s","value":"","description":"Specifies the alias or executable name of the RemoteApp."},
        "workspaceid": {"type":"s","value":"","description":"This setting defines the RemoteApp and Desktop ID associated with the RDP file that contains this setting.\n\nNo"}
    },

    "Session": {
        "administrative session": {"type":"i","value":"0","description":"Connect to the administrative session of the remote computer.\n\n0 - Do not use the administrative session.\n1 - Connect to the administrative session."},
        "alternate shell": {"type":"s","value":"","description":"Specifies a program to be started automatically when you connect to a remote computer. The value should be a valid path to an executable file.\nThis setting only works when connecting to servers."},
        "disable ctrl+alt+del": {"type":"i","value":"1","description":"Determines whether you have to press CTRL+ALT+DELETE before entering credentials after you are connected to the remote computer.\n\n0 - CTRL+ALT+DELETE is required before logging in.\n1 - CTRL+ALT+DELETE is not required. You can logon immediately.\n\nNote: When disabled, this setting will also delay the autologin until the user has pressed CTRL+ALT+DELETE."},
        "disableconnectionsharing": {"type":"i","value":"0","description":"Determines whether a new Terminal Server session is started with every launch of a RemoteApp to the same computer and with the same credentials.\n\n0 - No new session is started. The currently active session of the user is shared.\n1 - A new login session is started for the RemoteApp."},
        "displayconnectionbar": {"type":"i","value":"1","description":"Determines whether the connection bar appears when you are in full screen mode.\n\n0 - Do not show the connection bar.\n1 - Show the connection bar."},
        "keyboardhook": {"type":"i","value":"2","description":"Determines how Windows key combinations are applied when you are connected to a remote computer.\n\n0 - Windows key combinations are applied on the local computer.\n1 - Windows key combinations are applied on the remote computer.\n2 - Windows key combinations are applied in full-screen mode only."},
        "pinconnectionbar": {"type":"i","value":"1","description":"Determines whether or not the connection bar should be pinned to the top of the remote session upon connection when in full screen mode.\n\n0 - The connection bar should not be pinned to the top of the remote session.\n1 - The connection bar should be pinned to the top of the remote session."},
        "public mode": {"type":"i","value":"0","description":"Determines whether Remote Desktop Connection will be started in public mode.\n\n0 - Remote Desktop will not start in public mode .\n1 - Remote Desktop will start in public mode and will not save any user data (credentials, bitmap cache, MRU) on the local machine."},
        "redirectclipboard": {"type":"i","value":"1","description":"Determines whether the clipboard on the client computer will be redirected and available in the remote session and vice versa.\n\n0 - Do not redirect the clipboard.\n1 - Redirect the clipboard."},
        "redirectwebauthn": {"type":"i","value":"1","description":"Determines whether WebAuthn requests on the remote computer will be redirected to the local computer allowing the use of local authenticators (such as Windows Hello for Business and security key).\n\n0 - WebAuthn requests from the remote session aren't sent to the local computer for authentication and must be completed in the remote session.\n1 - WebAuthn requests from the remote session are sent to the local computer for authentication."},
        "shell working directory": {"type":"s","value":"","description":"The working directory on the remote computer to be used if an alternate shell is specified."}    
    },

    "Signature": {
        "signscope": {"type":"s","value":"","description":"Comma-delimited list of .rdp file settings for which the signature is generated when using .rdp file signing."}
    }
}
